[
  {
    "path": "posts/2021-08-16-research-paper/",
    "title": "R Shiny Developing for Analysis GAStech Employee Disappearance",
    "description": {},
    "author": [
      {
        "name": "LUO Haoyu",
        "url": {}
      },
      {
        "name": "HUANG Shan",
        "url": {}
      }
    ],
    "date": "2021-08-19",
    "categories": [],
    "contents": "\r\n1.Introduction\r\nNowadays, data as an important record medium, has been employed in various fields and industries, which is helpful to explore valuable understanding. For example, supermarket could identify different customers segment by analyzing transactions records. The government could get the traffic situation which disclosed by GPS data. Apart from it, with huge data source, combined different data has been more and more popular in data analysis. Like police station, usually analyse vast huge data to track the suspicious behaviours and clue.\r\nRefer to the analysed case background, transaction record in loyalty and credit card, movement of car used by employee in GPS data would be provided. In order to identifying anomalies and suspicious behaviors with strong evidence, we present a user-side dynamic and interactive data analytics dashboard. We hope to provide police station and relative bureau with a behavior and geo visual analytics tool for them to detect the desired and unexpected pattern from transaction and spatial-temporal movement data.\r\nThis paper reports on our research and development process of layout and implement a web-enabled user-based visual analytics tool for desired analysis requirement and visualization delivery. The designed application includes 3 sections. Section 1 provides a basic exploratory analysis of transaction data, the bar chart used to disclose the popularity of transaction location, the density line would show the transaction distribution of day and time, link_active would be employed to connect the two different type plots. Section 2 aim to mapping the gps data and visualize the employee’s life pattern. The employee’s life patten would be shown by Gantt chart. It would regard as a main analysis part of detecting anomaly behaviors. The section 3 would show the methodology of refer location with latitude and longitude. The cluster method would be used to group the closing data.\r\nAbove the sections would be discussed in this report, apart from it, the motivation, review on past works, dem and future direction would be introduced in this paper.\r\n2.Motivation of the application\r\nOur research and visualization work were motivated by the practical analysis requirement which are short of interactive and communicate for users to make customized input selection and combine different data analysis. It aims to support police station and relative official bureau to detect suspicious movement and transaction activity. Below is the specific planned design for the application:\r\nTo be interactive combined transaction location plot and transaction data & day plot.\r\nVisualize gps data on map to support movement analysis.\r\nConfirm the movement stop point in gps data with specified location.\r\nTo provide an interactive Gannt plot that can display each person’s transaction history and car movement pattern, at the same time the user’s target observation could connect to the map’s relative observation.\r\nUser-friendly which enable users could select input in terms theirs own demand and requirement.\r\nTo be able to be employed in more broaden fields.\r\n3.Review and critic on past works\r\nMost of the past work, there are not enough design for interactive and connective. Each of the plot usually static and separately which it’s hard for users to make customized analysis and comprehensive analysis.\r\nAnd for our own past works, the inconsistent of design thinking and real technology skills is the main problem of the overall work. Apart from it, away from the main topic and pay more attention on details is another point that influence the whole project output.\r\n4.Design framework.\r\nThe design of the application follows closely our data analysis process we used. Exploratory analysis on transaction data, gps data analysis, further analysis of combined data. It consists of three major tabpanels namely: transaction analysis, cluster analysis, gps analysis to disclose different observation from different aspects of the data to the user.\r\nFirstly, the panel on the left side is the selection input area which provide the user’s customized selection. On the right side, there is the main panel which mainly provide the visualization work (Figute.1).\r\n Figure.1: Overview of shiny app\r\nBelow is the detail description:\r\nFor tabpanel1 (Figure2), At the top most of the panel is the bar chart of transaction location frequency, by clicking different bar, below the bar chart will show two density plot which plot the transaction distribution by day and time separately in terms of the specific location selected by click.\r\n Figure.2: Tabpanel1 of shiny app\r\nFor tabpanel2 (Figure3), the top line is the selection input of zoom which could enlarge or smaller the map size. Below is a map which plot the clustered point on the map. It would be an necessary part to support users connect gps point with provided location name on the map.\r\n Figure.3: Tabpanel2 of shiny app\r\nFor tabpanel3 (Figure4), firstly, on the top left, there is a Gantt which is an overview of each employee’s movement pattern in each day. It could be a good way to find the unnormal activity compared with other days. On the top right, it’s a map with movement path and stop point. On the bottom panel, there is a specified Gannt on specified day to meet user’s detail analysis.\r\n Figure.4: Tabpanel3 of shiny app\r\n5.Demonstration - Use case\r\nBy using cluster analysis, timeline and map visualizations for the GPS data, we can get very clear visualization of each members’ activity and visited place on each day. This can be also applied to various GPS data. Like tracking the route and finding anomalies for visitors in a zoo, and also the most popular route and places for a playground.\r\n6.New insight enabled in our application\r\nThe highlight insight we want to stress is the Gantt plot. We used cluster method to group the gps data point to confirm the specified location, plot the activity period by Gannt in each day for each person. At the same time, color the plot by activity type. overview of the plot, it would be more efficiency for audience to identify the anomaly in activities and time compared with other day records.\r\n7.Future work\r\nThe current system we developed is based on a specified case, the aspect of data is limited. For the extend development, add more broaden data resources would be more powerful to support analysis. Apart from it, more interactive function added would be a plus to make more detail and comprehensive analysis.\r\nAlso, after improving our application in the future, we hope it could be used in mode broaden fields apart from police station, like analyze specified area’s citizen’s\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-19T23:27:47+08:00",
    "input_file": "research-paper.knit.md"
  },
  {
    "path": "posts/2021-08-16-shiny/",
    "title": "shiny",
    "description": "Please view the shiny at <https://group6project.shinyapps.io/Project/>.",
    "author": [
      {
        "name": "Luo haoyu, Huangshan",
        "url": {}
      }
    ],
    "date": "2021-08-16",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-16T22:48:04+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-16-userguide/",
    "title": "userguide",
    "description": "A short description of the userguide.",
    "author": [
      {
        "name": "Luo haoyu, Huangshan",
        "url": {}
      }
    ],
    "date": "2021-08-16",
    "categories": [],
    "contents": "\r\n1.You can click on the graph in transaction analysis panel to get the detailed activity of each place by hour and by day.\r\n2.You can click on the graph in cluster analysis to get the specific cluster and ID of each node.\r\n3.You can click on the dashboard button on the top to get a panel to modify id and day, which can select day and id for result on graph in the gps analysis panel.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-16T23:26:44+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-16-poster/",
    "title": "Poster",
    "description": "Poster",
    "author": [
      {
        "name": "Luo haoyu, Huangshan",
        "url": {}
      }
    ],
    "date": "2021-08-16",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-16T23:37:04+08:00",
    "input_file": "poster.knit.md"
  },
  {
    "path": "posts/2021-06-20-visual-analytics-project/",
    "title": "Visual Analytics Project Proposal",
    "description": "This is a project proposal about the Vast Chanllenge 2021 in 'https://vast-challenge.github.io/2021/'",
    "author": [
      {
        "name": "Luo haoyu, Huangshan",
        "url": {}
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\nMotivation\r\nIn challenge 2 we have two weeks vehicle tracking data of the employees and their credit card and loyalty card transactions data. These datasets combine geospatial data with aspatial information and time information which allow us to use geospatial analysis and time-series analysis.\r\nOur analysis will link these data through both geospatial and time analysis. We will try to identify suspicious patterns of behavior, involved locations and people.\r\nObjectives\r\nThe project aims to deliver an R-Shiny app that provides:\r\nInteractive user interface design.\r\nVehicle tracking information and all locations interfaced with a visual map representation.\r\nA visual timeline representation for each car with corresponding classified location types by different color.\r\nA visual timeline representation for cars with their activity and stop information.\r\nProposed Scope and Methodology\r\nAnalysis of dataset with background search and assumption making.\r\nOverview spatial map:\r\nAn overview map combined with tracking data colored by car's ID will be used to detect low frequency state occurred.\r\nCluster analysis:\r\nAmong the grouped employee with similar consumption feature to find the unusual activities compared with others.\r\nGannet chart:\r\nShow the all-day movement status (blank means stop and colored line means moving) for each car, to compare the movement pattern to find the possible suspicious activity.\r\nCalendar chart:\r\nPresent daily time distribution of each employee and color chart in terms of different activity categories to see abnormal activities.\r\nSpatial-temporal analysis\r\nAim to realize the analysis across both space and time at the same time. Support viewers created automatic proximity detection with a user definable space and a time window.\r\nEdit proposal and process by R Markdowns.\r\nUtilize R-shiny app to achieve user interactivities.\r\nTimeline\r\nA generalized development timeframe for this project is shown below.\r\n\r\nPrototypes\r\nThe prototypes for this project is shown below. \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-08-16T23:26:00+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Visual Analytics Project by G6",
    "description": "Welcome to our new blog, Visual Analytics Project by G6. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Luo haoyu, Huangshan",
        "url": {}
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-20T18:07:46+08:00",
    "input_file": {}
  }
]
